БИТУправление_медицинским_центром_демо/src/InformationRegisters/Лиды/Лиды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лиды</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Лид</name>
    <type>
      <types>DocumentRef.ЛистОжидания</types>
      <types>DocumentRef.Событие</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаБезСкидок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВидыСертификатов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <posting>Deny</posting>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Перенесенная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.ВидыСостоянийЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДляОтката</name>
    <type>
      <types>CatalogRef.ВидыСостоянийЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>Кабинет</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКлиента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХочуРаньше</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечаниеХочуРаньше</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборХочуРаньше</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеЗаписиВРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимДлительностиЗаявки</name>
    <type>
      <types>EnumRef.РежимДлительностиЗаявки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование1</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование2</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование3</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьИзмененаВручную</name>
      <comment>Используется в форме заявки при установке нормативной продолжительности</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборыХочуРаньше</name>
    <attributes>
      <name>Фильтр</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/Событие/Событие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Событие</name>
  <basedOn>Document.Заявка</basedOn>
  <basedOn>Document.Событие</basedOn>
  <basedOn>Document.ЛистОжидания</basedOn>
  <basedOn>Task.ЗадачиПользователя</basedOn>
  <basedOn>Document.ОбратнаяСвязь</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеСобытия</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВидыСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Цель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗвонка</name>
    <type>
      <types>CatalogRef.ТипыЗвонков</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходЗвонка</name>
    <type>
      <types>CatalogRef.ИсходыЗвонка</types>
    </type>
  </attributes>
  <attributes>
    <name>УспешностьЗвонка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвонокНачат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвонокЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьЗвонка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьРазговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>удалитьВидЗвонка</name>
    <type>
      <types>EnumRef.фонВидыЗвонков</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>бит_НабранныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРекламы</name>
    <comment>UTM_MEDIUM</comment>
    <type>
      <types>CatalogRef.ТипыРекламы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <comment>UTM_SOURCE</comment>
    <type>
      <types>CatalogRef.ИсточникиИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>РекламнаяКомпания</name>
    <comment>UTM_CAMPAIGN</comment>
    <type>
      <types>CatalogRef.РекламныеКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевоеСловоРекламнойКомпании</name>
    <comment>UTM_TERM</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеОбъявления</name>
    <comment>UTM_CONTENT</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/Лиды/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Добавить лид в регистр лидов.
//
// Параметры:
//  ДанныеЛида	 - Структура - данные лида в соответствии со структурой регистра.
//
Процедура ДобавитьЛид(ДанныеЛида) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НоваяЗапись = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, ДанныеЛида);
	НоваяЗапись.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Обновить запись лида в регистре
//
// Параметры:
//  ДанныеЛида			 - Структура - данные лида
//  ОбновляемыйПараметр	 - Структура - обновляемый параметр.
//
Процедура ОбновитьЗаписьЛида(ДанныеЛида, ОбновляемыйПараметр = Неопределено) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Клиент.Установить(ДанныеЛида.Клиент);
	НаборЗаписей.Отбор.Период.Установить(ДанныеЛида.Период);
	НаборЗаписей.Отбор.Лид.Установить(ДанныеЛида.Лид);
	
	Если ОбновляемыйПараметр <> Неопределено Тогда
		НаборЗаписей.Прочитать();
		НаборЗаписей[0][ОбновляемыйПараметр.Имя] = ОбновляемыйПараметр.Значение;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Добавить первичный лид.
//
// Параметры:
//  ДанныеЛида				 - Структура - данные лида
//  ДополнительныеСвойства	 - Структура - дополнительные свойства
//  ПроверятьПрошлыеСобытия	 - Булево	 - проверять прошлые события
// 
// Возвращаемое значение:
//  Булево - лид создан.
//
Функция ДобавитьПервичныйЛид(ДанныеЛида, ДополнительныеСвойства, ПроверятьПрошлыеСобытия = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ЛидСоздан = Ложь;
	
	СрокЖизниЛида = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("СрокЖизниЛида");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лиды.Период КАК Период,
	|	Лиды.Лид КАК Лид,
	|	Лиды.ДатаОкончания КАК ДатаОкончания,
	|	Лиды.Клиент КАК Клиент
	|ИЗ
	|	РегистрСведений.Лиды КАК Лиды
	|ГДЕ
	|	Лиды.Клиент = &Клиент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("Клиент", ДанныеЛида.Клиент);
	
	ТекущаяСтрока	 = Новый Структура("Клиент, ДатаОкончания, Лид, Период");
	ПредыдущаяСтрока = Новый Структура("Клиент, ДатаОкончания, Лид, Период");
	СледующаяСтрока	 = Новый Структура("Клиент, ДатаОкончания, Лид, Период");
	СледующаяСтрока2 = Новый Структура("Клиент, ДатаОкончания, Лид, Период");
	
	РезультатЗапросаЛиды = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапросаЛиды.Количество() = 0 И ПроверятьПрошлыеСобытия Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(Продажи.Период) КАК Дата
		|ИЗ
		|	РегистрНакопления.Продажи КАК Продажи
		|ГДЕ
		|	Продажи.Клиент = &Клиент
		|	И Продажи.Период < &Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МАКСИМУМ(Заявка.Дата)
		|ИЗ
		|	Документ.Заявка КАК Заявка
		|ГДЕ
		|	Заявка.Клиент = &Клиент
		|	И Заявка.ПометкаУдаления = ЛОЖЬ
		|	И Заявка.Дата < &Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
		Запрос.УстановитьПараметр("Клиент", ДанныеЛида.Клиент);
		Запрос.УстановитьПараметр("Дата", ДанныеЛида.Период);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл
			Если ЗначениеЗаполнено(РезультатЗапроса.Дата)
				И РезультатЗапроса.Дата + 3600*24*СрокЖизниЛида > ДанныеЛида.Период
			Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Пока РезультатЗапросаЛиды.Следующий() Цикл
		Если РезультатЗапросаЛиды.Период < НачалоДня(ДанныеЛида.Период) Тогда
			ЗаполнитьЗначенияСвойств(ПредыдущаяСтрока, РезультатЗапросаЛиды);
		ИначеЕсли РезультатЗапросаЛиды.Период = НачалоДня(ДанныеЛида.Период) Тогда
			Возврат Ложь;
		ИначеЕсли РезультатЗапросаЛиды.Лид = ДанныеЛида.Лид Тогда
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, РезультатЗапросаЛиды);
		Иначе
			Если Не ЗначениеЗаполнено(СледующаяСтрока.Лид) Тогда
				ЗаполнитьЗначенияСвойств(СледующаяСтрока, РезультатЗапросаЛиды);
			Иначе
				ЗаполнитьЗначенияСвойств(СледующаяСтрока2, РезультатЗапросаЛиды);
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПредыдущаяСтрока.Лид) Тогда
		// Получение последней активности клиента
		
		ДатаНачала = ПредыдущаяСтрока.Период;
		ДатаОкончания = ?(ЗначениеЗаполнено(СледующаяСтрока.Клиент), СледующаяСтрока.Период, ДанныеЛида.Период);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(Продажи.Период) КАК Период
		|ИЗ
		|	РегистрНакопления.Продажи КАК Продажи
		|ГДЕ
		|	Продажи.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Продажи.Клиент = &Клиент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МАКСИМУМ(Заявка.Дата)
		|ИЗ
		|	Документ.Заявка КАК Заявка
		|ГДЕ
		|	Заявка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Заявка.Клиент = &Клиент
		|	И Заявка.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		
		Запрос.УстановитьПараметр("Клиент",			ДанныеЛида.Клиент);
		Запрос.УстановитьПараметр("ДатаНачала",		ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания",	ДатаОкончания);
		
		РезультатЗапросаАктивность = Запрос.Выполнить().Выбрать();
		ДатаПоследнейАктивности = ДатаНачала;
		
		Пока РезультатЗапросаАктивность.Следующий() Цикл
			Если ЗначениеЗаполнено(РезультатЗапросаАктивность.Период) Тогда
				ДатаПоследнейАктивности = РезультатЗапросаАктивность.Период;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		ДатаПоследнейАктивности = ДанныеЛида.Период;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ПометкаНаУдаление Тогда
		// Проверяем, является ли документ лидом
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Лид) Тогда
			Возврат Ложь;
		КонецЕсли;
		// Если является - удаляем
		РегистрыСведений.Лиды.ОбновитьЗаписьЛида(ТекущаяСтрока);
		
		// Добавляем вместо него по возможности другое событие/ЛО, которое не противоречит условию
		
		Если ЗначениеЗаполнено(СледующаяСтрока.Клиент) Тогда
			ДатаНачалаСледующегоЛида = СледующаяСтрока.Период;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Событие.Ссылка КАК Ссылка,
		|	Событие.ДатаФакт КАК Дата,
		|	Событие.Клиент КАК Клиент
		|ИЗ
		|	Документ.Событие КАК Событие
		|ГДЕ
		|	Событие.ПометкаУдаления = ЛОЖЬ
		|	И Событие.ИсточникИнформации <> ЗНАЧЕНИЕ(Справочник.ИсточникиИнформации.ПустаяСсылка)
		|	И Событие.Клиент = &Клиент
		|	И Событие.ДатаФакт > &ДатаНачала
		|	И (Событие.ДатаФакт < &ДатаОкончания
		|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистОжидания.Ссылка,
		|	ЛистОжидания.Дата,
		|	ЛистОжидания.Клиент
		|ИЗ
		|	Документ.ЛистОжидания КАК ЛистОжидания
		|ГДЕ
		|	ЛистОжидания.ПометкаУдаления = ЛОЖЬ
		|	И ЛистОжидания.ИсточникИнформации <> ЗНАЧЕНИЕ(Справочник.ИсточникиИнформации.ПустаяСсылка)
		|	И ЛистОжидания.Клиент = &Клиент
		|	И ЛистОжидания.Дата > &ДатаНачала
		|	И (ЛистОжидания.Дата < &ДатаОкончания
		|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
		
		Запрос.УстановитьПараметр("ДатаНачала", ДатаПоследнейАктивности);
		Запрос.УстановитьПараметр("ДатаОкончания", ?(ЗначениеЗаполнено(СледующаяСтрока.Клиент), СледующаяСтрока.Период, Дата(1,1,1)));
		Запрос.УстановитьПараметр("Клиент", ДанныеЛида.Клиент);
		
		РезультатЗапросаОбращения = Запрос.Выполнить().Выбрать();
		
		Пока РезультатЗапросаОбращения.Следующий() Цикл
			
			Если ЗначениеЗаполнено(СледующаяСтрока.Клиент) Тогда
				Если СледующаяСтрока.Период = РезультатЗапросаОбращения.Дата Тогда
					Прервать;
				Иначе
					ДатаСледующегоЛида = СледующаяСтрока.Период;
				КонецЕсли;
			КонецЕсли;
			
			СтруктураДобавляемогоЛида = Новый Структура();
			СтруктураДобавляемогоЛида.Вставить("Период", РезультатЗапросаОбращения.Дата);
			СтруктураДобавляемогоЛида.Вставить("Лид", РезультатЗапросаОбращения.Ссылка);
			СтруктураДобавляемогоЛида.Вставить("Клиент", РезультатЗапросаОбращения.Клиент);
			
		КонецЦикла;
		
		Если СтруктураДобавляемогоЛида <> Неопределено
			И ЗначениеЗаполнено(СледующаяСтрока.Клиент)
			И СледующаяСтрока.Период - СтруктураДобавляемогоЛида.Период < 3600*24*СрокЖизниЛида
		Тогда
			// Удалить следующий лид, если между ним и новым дней меньше, чем в константе
			РегистрыСведений.Лиды.ОбновитьЗаписьЛида(СледующаяСтрока);
			
			Если ЗначениеЗаполнено(СледующаяСтрока2.Клиент) Тогда
				ДатаСледующегоЛида = НачалоДня(СледующаяСтрока2.Период) - 1;
			КонецЕсли;
		КонецЕсли;
		
		Если ДатаСледующегоЛида <> Неопределено Тогда
			// Надо закрыть текущий лид, если после него есть еще лиды
			СтруктураДобавляемогоЛида.Вставить("ДатаОкончания", ДатаСледующегоЛида);
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(ПредыдущаяСтрока.Клиент) Тогда			
			Если ДанныеЛида.Период - ДатаПоследнейАктивности < 3600*24*СрокЖизниЛида
				И ЗначениеЗаполнено(ПредыдущаяСтрока.Лид)
			Тогда
				Возврат Ложь;
			Иначе
				РегистрыСведений.Лиды.ОбновитьЗаписьЛида(ПредыдущаяСтрока, Новый Структура("Имя, Значение", "ДатаОкончания", НачалоДня(ДанныеЛида.Период) - 1));
				СтруктураДобавляемогоЛида = ДанныеЛида;
			КонецЕсли;
		Иначе
			СтруктураДобавляемогоЛида = ДанныеЛида;
		КонецЕсли;
		
		Если СтруктураДобавляемогоЛида <> Неопределено И ЗначениеЗаполнено(СледующаяСтрока.Клиент) Тогда
			Если СледующаяСтрока.Период - ДанныеЛида.Период < 3600*24*СрокЖизниЛида Тогда
				// Заменить следующую строку
				РегистрыСведений.Лиды.ОбновитьЗаписьЛида(СледующаяСтрока);
				Если ЗначениеЗаполнено(СледующаяСтрока2.Клиент) Тогда
					СтруктураДобавляемогоЛида.Вставить("ДатаОкончания", СледующаяСтрока2.Период - 1);
				КонецЕсли;
			Иначе
				СтруктураДобавляемогоЛида.Вставить("ДатаОкончания", СледующаяСтрока.Период - 1);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураДобавляемогоЛида <> Неопределено Тогда
		РегистрыСведений.Лиды.ДобавитьЛид(СтруктураДобавляемогоЛида);
		ЛидСоздан = Истина;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ЛидСоздан;
	
КонецФункции

#КонецОбласти
